import cartImg from "./../../assets/cart.png";
import Nav from "./../../components/Nav";
import Footer from "./../../components/Footer";
import { Link } from "react-router-dom";
import { TextContext } from "./../../context/textContext";
import { useContext } from "react";
import s from "./style.module.css";
import cn from "classnames";

const AboutPageUa = () => {
  const context = useContext(TextContext);

  return (
    <main className="about content">

      <div className={cn(s.banner, s.parallax, s.white)}>
        <div>
          <h1>Наша олійна історія</h1>
          <p className={s.subtitle}>
            або, чому саме сиродавлена олія, та навіщо треба дубова бочка
          </p>
          <a onClick={context.scroll} className={cn("button", s.big_button, s.bgbeige)} href="">Як це було ▼</a>
        </div>
      </div>

      <h2>З чого все починалося</h2>

      <div className="p50 tLeft">
        <p>
          Кілька років тому нас пригостили лляною олією і вона нам дуже
          сподобалась.
        </p>

        <p>
          Ми і раніше багато чули про її користь для здоров&#39;я, і ​​високий
          вміст Омега-3.
        </p>

        <p>Це було як маленьке відкриття для нас тоді.</p>
        <blockquote>
          <p> &laquo;Вау, нарешті ми знайшли чудовий продукт!&raquo;.</p>
        </blockquote>

        <p>
          Але одна річ в тому маслі трохи заважала - легкий присмак гіркоти.
        </p>

        <blockquote>
          <p>
            &laquo;Ну, це особливість лляної олії, воно повинно бути з
            гірчинкою&raquo;, - думали ми.
          </p>
        </blockquote>

        <p>Лляна олія куплена в аптеці взагалі була жахливо гіркою.</p>
        <blockquote>
          <p>&laquo;Вона є лікарська&raquo; - заспокоював себе я.</p>
        </blockquote>
        <p>Але одного разу хтось пригостив нас свіжовіджатою лляною олією.</p>

        <blockquote>
          <p>І, &laquo;О, диво!&raquo; - в неї не було гіркоти.</p>

          <p>Ми не могли повірити. &laquo;Це точно лляна олія?&raquo;</p>
        </blockquote>

        <p>
          Вона була зовсім іншою - з абсолютно чистим смаком і більш стриманим
          трав&#39;яним ароматом.
        </p>

        <p>
          Ми задалися питанням, чому всі відомі нам до того лляні олії -
          гірчать?
        </p>

        <p>
          Адже ми купували справжні, нерафіновані олії. Напевно, найкращі, які
          можна було знайти на той момент.
        </p>

        <p>
          Ми стали шукати причину. Ми провели ціле дослідження. І, нарешті,
          розібралися.
        </p>

      </div>

      <div className={cn(s.banner, s.parallax1, s.white)}>
        <div>
          <h1>Що ми з'ясували</h1>
          <p className={s.subtitle}>
           результати нашого олійного дослідження
          </p>
        </div>
      </div>

      <h3 className="mTop0">Відкриття №1. Сиродавлену олію не можна довго зберігати</h3>

      <div className="p50 tLeft">

        <p>
          Якщо лляне олія коштує багато днів при кімнатній температурі в магазині
          або аптеці - воно повністю згіркле.
        </p>

        <p>
          Так, на неї далі написано &quot;холодний віджим, Extra Virgin, термін
          зберігання (багато) місяців&quot;. Але воно вже окислене.
        </p>

        <p>
          Для просочення дерева таке олія чудово підходить. Для вживання в їжу -
          не найкраща.
        </p>

      </div>

      <h3>Відкриття №2. Виробники нагрівають (підсмажують) зерно</h3>

      <div className="p50 tLeft">

        <p>
          Навіщо взагалі нагрівати льон, якщо це псує олію? Вони що, не знають що
          роблять?
        </p>

        <p>
          Знають :) З сильно нагрітого льону можна віджати в 2-3 рази більше oлії
          ніж з холодного насіння. Це велика різниця в ціні. Вони вміють рахувати
          гроші.
        </p>

      </div>

      <h3>Відкриття №3. Всі сиродавлені oлії швидко окислюються</h3>

      <div className="p50 tLeft">

      <p>
          Лляна окислюється швидше за всі. Але всі
          сиродавлені oлії потрібно зберігати в холодильнику і не більше місяця.
          Після цього терміну вони теж їстівні, але якість вже не та.
      </p>
      <p>
          При
          кімнатній температурі через місяць сиродавлені oлії (крім кокосової) вже
          гірчать.
      </p>
      <p>
          Саме тому, промислово виробляють <b>рафіновану</b> олію, яку
          можна зберігати аж 2 роки.
        </p>

      </div>

      <h3>
        Відкриття №4. Шнековий олійний прес нагріває зерно в процесі подрібнення
      </h3>

      <div className="p50 tLeft">
        <p>
          Після місяця вивчення всіх доступних моделей пресів в України, Китая,
          США та ближнього зарубіжжя, картина стала трохи прояснюватися.
        </p>
        <p>
          Всі автоматичні (електричні і паливні) преси вичавлюють олію за допомогою
          шнека, при цьому неминуче нагрівають зерно. Це - частина процесу їх роботи.
        </p>
      </div>

      <h3>Відкриття №5. Олія трохи окислюється від контакту з металом</h3>

      <div className="p50 tLeft">
        <p>
          Я був не впевнений в цьому, але знайшов таку науково-дослідницьку публикацію з цього питання.
        </p>
        <p>
          (Знайти та додати посилання на наукову публикацію)
        </p>
      </div>

      <h3>Підсумок</h3>

      <div className="p50 tLeft">

        <p>Ми просто хотіли вживати здорову рослинну олію. Не щось особливо розкішне.</p>

        <p>
          Добру, чисту, натуральну, не окислену олію. Але виявилося, що нам навіть
          нема де її купити.
        </p>
        <p>
          Ми шукали надійного виробника, якому ми б могли
          довіряти, але не знайшли.
        </p>

        <blockquote>
          <p>
            &laquo;Раз ніде купити, то треба вичавити таку олію самостійно&raquo;
            - промовила моя дружина
          </p>
        </blockquote>

        <p>
          Боротися з дружиною вже не було сенсу. Тоді ми дружно замовили виготовлення
          дубового преса і я зібрав цю важку конструкцію у нас на кухні.
        </p>

      </div>

      <div className={cn(s.banner, s.parallax2, s.white)}>
        <div>
          <h1>Ми обрали прес дубова бочка</h1>
          <p className={s.subtitle}>
            Бо тільки в цьому пресі насіння не нагріваються і не контактують з металом
          </p>
        </div>
      </div>

      <h2>Тепер є де купити справжню олію</h2>

      <div className="p50 tLeft">

        <p>
          Вичавлювати на цьому пресі виявилося нелегко. Але олія дійсно виходила казково
          гарна.
        </p>

        <p>
          Нам так подобалась, що ми додавати цю олію всюди - в супи, в каші в
          салати (хіба що в чай ​​не наливали).
        </p>

        <p>Поступово почали пригощати родичів, друзів та знайомих...</p>

        <p>
          І, ось, через 2 роки, ми відкрили цей сайт, на якому ви можете замовити
          віджимання і відправку цеї самої сиродавленої oлії з дубової бочки.
        </p>

        <p>
          Щоб зберегти його унікальні якості, відразу після віджимання ми
          розливаємо його в темні скляні пляшки, ставимо в холодильник і висилаємо
          в той же день Новою Поштою.
        </p>

        <p>
          Якщо ви живете у Львові, також можемо привезти олію вам до Ашану (пр.
          В'ячеслава Чорновола, 16і) або в кафе Грін (вул. Братив Рогатинців, 5).
        </p>

        <p>
          Ми щасливі, що у нас є можливість поділитися ним з вами. І просимо, щоб
          ви замовляли трохи заздалегідь, ми не такі великі, і нам потрібно хоча-б
          пару днів, щоб виконати навіть маленький замовлення.
        </p>

        <p>
          <em>З любов&#39;ю, Володимир та Лілія</em>
        </p>

      </div>
    </main>
  );
};

function AboutPage() {
  const context = useContext(TextContext);

  if (context.ua) {
    return (
      <>
        <Nav />
        <AboutPageUa />
        <Footer />
      </>
    );
  } else {
    return (
      <>
        <Nav />

        <Footer />
      </>
    );
  }
}

export default AboutPage;
