import cartImg from './../../assets/cart.png';
import Nav from './../../components/Nav';
import Footer from './../../components/Footer';
import {Link} from 'react-router-dom';
import {TextContext} from './../../context/textContext';
import {useContext} from 'react';

function AboutPage() {

  const context = useContext(TextContext);

  return (
    <>
      <Nav />

      <header>
        <div className="inner">
          <div className="phone" hidden>
            <a href="tel:+380959300302">+38(095)930-03-02</a>
          </div>
          <div className="cart">
            <Link to="cart"><button className="white-button"><img src={cartImg} alt="Корзина замовлення" /></button></Link>
            <div className="amount">товарів: <strong>{context.amount}</strong> шт</div>
            <div className="sum">сума: <strong>{context.sum}</strong> грн</div>
          </div>
        </div>
      </header>

      <main className="about content">
        <h2>Про нас</h2>
        <h1>Наша історія, або чому сиродавлена олія, віджата в дубовій бочці - найкорисніша</h1>

        <h2>З чого все починалося</h2>

        <p>Кілька років тому нас пригостили лляною олією і вона нам дуже сподобалась.</p>

        <p>Ми і раніше багато чули про її користь для здоров&#39;я, і ​​високий вміст Омега-3.</p>

        <p>Це було як маленьке відкриття для нас тоді.</p>
        <blockquote>
        <p> &laquo;Вау, нарешті ми знайшли чудовий продукт!&raquo;.</p>
        </blockquote>

        <p>Але одна річ в тому маслі трохи заважала - легкий присмак гіркоти.</p>

        <blockquote>
        <p>&laquo;Ну, це особливість лляної олії, воно повинно бути з гірчинкою&raquo;, - думали ми.</p>
        </blockquote>

        <p>Лляна олія куплена в аптеці взагалі була жахливо гіркою.</p>
        <blockquote>
        <p>&laquo;Вона є лікарська&raquo; - заспокоював себе я.</p>
        </blockquote>
        <p>Але одного разу хтось пригостив нас свіжовіджатою лляною олією.</p>

        <blockquote>
        <p>І, &laquo;О, диво!&raquo; - в неї не було гіркоти.</p>

        <p>Ми не могли повірити. &laquo;Це точно лляна олія?&raquo;</p>

        </blockquote>

        <p>Вона була зовсім іншою - з абсолютно чистим смаком і більш стриманим трав&#39;яним ароматом.</p>

        <p>Ми задалися питанням, чому всі відомі нам до того лляні олії - гірчать?</p>

        <p>Адже ми купували справжні, нерафіновані олії. Напевно, найкращі, які можна було знайти на той момент.</p>

        <p>Ми стали шукати причину. Ми провели ціле дослідження. І, нарешті, розібралися.</p>

        <h2>Результати нашого дослідження</h2>

        <p><strong>Що саме ми з&#39;ясували:</strong> Льняна олія дуже чутливо до нагрівання, і в теплі відразу починає окислюватися</p>

        <h3>Відкриття №1. Сиродавлену олію не можна довго зберігати</h3>

        <p>Якщо лляне олія коштує багато днів при кімнатній температурі в магазині або аптеці - воно повністю згіркле.</p>

        <p>Так, на ньому далі написано &quot;холодний віджим, Extra Virgin, термін зберігання (багато) місяців&quot;. Але воно вже окислене.</p>

        <p>Для просочення дерева таке олія чудово підходить. Для вживання в їжу - не найкраща.</p>

        <h3>Відкриття №2. Виробники нагрівають (підсмажують) зерно</h3>

        <p>Навіщо взагалі нагрівати льон, якщо це псує олію? Вони що, не знають що роблять?</p>

        <p>Знають :) З сильно нагрітого льону можна віджати в 2-3 рази більше oлії ніж з холодного насіння. Це велика різниця в ціні. Вони вміють рахувати гроші.</p>

        <h3>Відкриття №3. Всі сиродавлені oлії швидко окислюються</h3>

        <p>Найкраща олія - свіжовичавлена. Лляна окислюється швидше за всі. Але всі сиродавлені oлії потрібно зберігати в холодильнику і не більше місяця. Після цього терміну вони теж їстівні, але якість уже не та. При кімнатній температурі через місяць сиродавлені oлії (крім кокосової) вже гірчать. Саме тому&nbsp; промислово виробляють рафіновану олію, яку можна зберігати аж 2 роки.</p>

        <h2>Як ми вибирали прес</h2>

        <p>Ми просто хотіли вживати здорову олію. Не щось особливо розкішне.</p>

        <p>Просто чисту, натуральну, не окислену олію. Але виявилося, що нам навіть нема де її купити. Ми шукали надійного виробника, якому ми б могли довіряти, але не знайшли.</p>

        <blockquote>
        <p>&laquo;Раз ніде купити, то можна вичавити таку олію самостійно&raquo; - промовила моя дружина</p>
        </blockquote>

        <blockquote>
        <p>&laquo;О ні, нам ще тільки преса для олії на кухні не вистачало&raquo; - подумав я, і почав делікатно відмовляти дружину від цієї ідеї.</p>
        </blockquote>

        <p>Але вона не здавалася. Минув рік.</p>

        <p>Через рік умовлянь вже здався я.</p>

        <blockquote>
        <p>&laquo;Ну добре, люба, купимо тобі прес, тільки давай маленький, недорогий і електричний.&raquo;</p>
        </blockquote>

        <p>Щоб місця не займав і сам олію вичавлював. Дружина заспокоїлася, і ми стали вибирати прес.</p>

        <h2>Нові відкриття</h2>

        <h3>Відкриття №4. Шнековий олійний прес нагріває зерно в процесі подрібнення</h3>

        <p>Після місяця вивчення всіх доступних моделей пресів в Україні, Китаї, США та ближньому зарубіжжі, картина стала трохи прояснюватися. Всі автоматичні (електричні і паливні) преси вичавлюють олію за допомогою шнека, при цьому неминуче нагрівають зерно. Це - частина процесу.</p>

        <h3>Відкриття №5. Олія трохи окислюється від контакту з металом.</h3>

        <p>Я знайшов науково-дослідницьку публикацію з цього питання. Тому для виробництва ідеального oлії (яку прагнуля моя дружина) жоден автоматичний прес не підійшов.</p>

        <p><strong>І тоді дружина захотіла справжній дерев&#39;яний пресс.</strong></p>

        <p>Боротися з дружиною вже не було сенсу, і ми дружно замовили виготовлення дубового преса і я зібрав цю конструкцію у нас на кухні.</p>

        <p>Вичавлювати на ньому виявилося нелегко. Але олія дійсно виходила казково гарна.</p>

        <p>Нам так подобалась, що ми додавати цю олію всюди - в супи, в каші в салати (хіба що в чай ​​не наливали).</p>

        <p>Поступово почали пригощати родичів, друзів та знайомих...</p>

        <h2>Тепер є де купити справжню олію</h2>

        <p>І, ось, через 2 роки, ми відкрили цей сайт, на якому ви можете замовити віджимання і відправку цеї самої сиродавленої oлії з дубової бочки.</p>

        <p>Щоб зберегти його унікальні якості, відразу після віджимання ми розливаємо його в темні скляні пляшки, ставимо в холодильник і висилаємо в той же день Новою Поштою.</p>

        <p>Якщо ви живете у Львові, то можемо привезти його вам до Ашану (пр. В'ячеслава Чорновола, 16і) або в кафе Грін (вул. Братив Рогатинців, 5).</p>

        <p>Ми щасливі, що у нас є можливість поділитися ним з вами. І просимо, щоб ви замовляли трохи заздалегідь, ми не такі великі, і нам потрібно хоча-б пару днів, щоб виконати навіть маленький замовлення.</p>

        <p><em>З любов&#39;ю, Володимир та Лілія</em></p>


      </main>

      <Footer />
    </>
  );
}

export default AboutPage;
